Revit 2024 API
Workset.Kind Property
 Kind of the workset.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public WorksetKind Kind { get; }
Visual Basic
Public ReadOnly Property Kind As WorksetKind
	Get
Visual C++
public:
property WorksetKind Kind {
	WorksetKind get ();
}
See Also
Workset Class
Autodesk.Revit.DB Namespace